[
	{
		"term": "Acceptance Testing",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Testing that validates whether a system meets business requirements and is ready for deployment or release, often defined or reviewed by business stakeholders."
	},
	{
		"term": "Adaptation Layer",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The layer in the Generic Test Automation Architecture (gTAA) that connects Robot Framework to the System Under Test or automated systems via keyword libraries."
	},
	{
		"term": "Atomic Element",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An execution element such as a library keyword or Robot Framework language statement that does not contain child steps; its status is determined only by its own execution result."
	},
	{
		"term": "Automation Script",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A Robot Framework suite, test, task, or keyword collection that automates a defined workflow or behavior."
	},
	{
		"term": "Argument",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A value passed to a keyword when it is called to customize its behavior. Arguments can have different kinds (for example positional, named, embedded) and may be mandatory or optional."
	},
	{
		"term": "Argument Interface",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The complete, ordered list of arguments that a keyword accepts, including their names, kinds, default values and optional type hints, as shown in keyword documentation."
	},
	{
		"term": "Behavior-Driven Development",
		"aliasses": [],
		"abbreviation": "BDD",
		"definition": "A development approach and collaboration practice that describes system behavior in business-readable language, often using Given/When/Then phrasing."
	},
	{
		"term": "Behavior-Driven Specification",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A declarative specification style in Robot Framework where tests|tasks describe system behavior from the user’s perspective, typically using natural-language-like steps with embedded arguments and prefixes such as Given/When/Then/And/But."
	},
	{
		"term": "Built-In Variables",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Special variables provided by Robot Framework that expose execution-related information such as paths, timestamps, and status without needing explicit definition."
	},
	{
		"term": "Command Line Interface",
		"aliasses": ["Robot Framework CLI"],
		"abbreviation": "CLI",
		"definition": "The interface used to run Robot Framework from the command line (e.g. with the `robot` command), configure execution options, and pass arguments or variables."
	},
	{
		"term": "Composite Element",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An execution element that is composed of other elements (for example a suite composed of tests|tasks, a test|task composed of keywords, or a user keyword composed of child keywords and statements) and whose status is derived from its children."
	},
	{
		"term": "Control Structure",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Statements like IF, FOR, WHILE, BREAK and CONTINUE used in Robot Framework to control the execution flow inside a test, task or keyword."
	},
	{
		"term": "Data-Driven Specification",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A style where the same logic or test flow is executed multiple times with different input and/or expected output data, often implemented using test|task templates in Robot Framework."
	},
	{
		"term": "Definition Layer",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The layer in the Generic Test Automation Architecture (gTAA) containing the test data, such as suites, tests, tasks, resource files, keywords, and variables written in Robot Framework syntax."
	},
	{
		"term": "Embedded Argument",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An argument whose value is part of the keyword name text itself, typically used in behavior-driven style steps like `Given \"robotframework.org\" is open`."
	},
	{
		"term": "End-to-End Test",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Tests that verify complete workflows across all relevant components, subsystems and interfaces to ensure that real-world user flows behave as expected."
	},
	{
		"term": "Execution Artifacts",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Files and outputs generated by Robot Framework execution, such as `output.xml`, `log.html`, and `report.html`, which document what was executed and with which results."
	},
	{
		"term": "Execution Layer",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The layer in the Generic Test Automation Architecture (gTAA) that includes Robot Framework’s parser, execution engine, logging, and reporting components which interpret test data and run keywords."
	},
	{
		"term": "Execution Model",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The internal representation created by Robot Framework after parsing suites, tests, tasks, and keywords, which the execution engine uses to perform automation."
	},
	{
		"term": "Fail Status",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An execution status indicating that an element (such as a keyword, test, task or suite) did not meet its expected outcome or raised an error during execution."
	},
	{
		"term": "FOR Loop",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A control structure in Robot Framework used to iterate over items in a list or other iterable and execute a body of keywords for each item."
	},
	{
		"term": "Generic Test Automation Architecture",
		"aliasses": ["gTAA"],
		"abbreviation": "gTAA",
		"definition": "A layered reference architecture for test automation that defines separation into definition, execution, and adaptation layers; used to describe Robot Framework’s role in an automation solution."
	},
	{
		"term": "Given / When / Then / And / But",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Conventional prefixes used in behavior-driven specification style. Robot Framework can ignore these prefixes when matching keywords if the remaining part of the name matches a keyword."
	},
	{
		"term": "Global Variable",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A variable with global scope that can be accessed from all suites and keywords in a Robot Framework execution."
	},
	{
		"term": "Higher-Level Suite (Suite Directory)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A directory that is treated as a suite because it (directly or indirectly) contains at least one suite file; it groups lower-level suites into a suite tree."
	},
	{
		"term": "Initialization File (__init__.robot)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A suite file located in a directory that configures that directory as a suite and can define suite-level settings, variables, setups and teardowns for all contained suites."
	},
	{
		"term": "Inline Comment",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A comment written either at the very beginning, or at the end of a line in a Robot Framework file, separated by at least two spaces and starting with a # so that it is ignored by the interpreter."
	},
	{
		"term": "Inline IF",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A compact IF statement form on a single line (IF  <condition>  <keyword>  [args]) used to execute one keyword conditionally without an END."
	},
	{
		"term": "K-Level (Knowledge Level)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A categorization of learning objectives based on Bloom’s Taxonomy: K1 (Remember), K2 (Understand), and K3 (Apply), indicating the expected depth of knowledge."
	},
	{
		"term": "Keyword",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A named, reusable action or sequence of actions in Robot Framework that can be called from tests, tasks or other keywords and may accept arguments and may return values."
	},
	{
		"term": "Keyword Interface",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The documented information of a keyword, including its name, arguments (with kinds and types), return values, documentation, and examples, as exposed for example by HTML documentation or IDEs."
	},
	{
		"term": "Keyword-Driven Specification",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An imperative specification style in Robot Framework where tests|tasks are written as sequences of keyword calls with arguments, focusing on what actions are executed and in which order."
	},
	{
		"term": "Keyword Library",
		"aliasses": ["Library"],
		"abbreviation": "",
		"definition": "A collection of library keywords implemented typically in Python (or other languages) that Robot Framework imports to interact with external systems, perform computations or provide utility functions."
	},
	{
		"term": "List Variable",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A Robot Framework variable of list type, accessed with the @{} syntax, that can hold an ordered collection of values and can be unpacked when passed to keywords."
	},
	{
		"term": "Local Variable",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A variable whose scope is limited to a single keyword, test or task execution and is not visible outside of that body."
	},
	{
		"term": "Log File (log.html)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A detailed HTML execution log generated by Robot Framework that shows keyword-level execution steps, arguments, messages and statuses."
	},
	{
		"term": "Metadata (Suite Metadata)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "Key–value information defined with the Metadata setting in a suite, used to document additional attributes such as author, version, or related requirements."
	},
	{
		"term": "Named Argument",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A keyword argument specified using its name followed by = and a value (for example timeout=10 seconds), allowing arguments to be provided in any order."
	},
	{
		"term": "Named-Only Argument",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A keyword argument that must be provided by name and cannot be given positionally."
	},
	{
		"term": "Output File (output.xml)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The main machine-readable execution result file produced by Robot Framework, containing the full execution tree, messages, and statistics in XML format."
	},
	{
		"term": "Pass Status",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An execution status indicating that an element (such as a keyword, test, task or suite) executed successfully and its expectations were met."
	},
	{
		"term": "Positional Argument",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A keyword argument provided solely by its position in the argument list without naming it explicitly."
	},
	{
		"term": "Report File (report.html)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A high-level HTML summary of a Robot Framework execution that focuses on statistics and overall pass/fail status of suites and tests|tasks."
	},
	{
		"term": "Resource File",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A file (commonly with extension .resource or .robot) that contains user keywords and variables and is imported by suites to share and reuse these artifacts."
	},
	{
		"term": "Return Statement (RETURN)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A statement used in user keywords to return one or more values that can be assigned to variables in the calling context."
	},
	{
		"term": "Return Type Hint",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A documented indication of the type of value a keyword returns, helping users understand how to use the returned data."
	},
	{
		"term": "Robotic Process Automation",
		"aliasses": ["RPA"],
		"abbreviation": "RPA",
		"definition": "Automation of business processes or tasks normally performed by humans, often across multiple systems, without necessarily focusing on testing."
	},
	{
		"term": "Robot Framework Foundation",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The non-profit association (Robot Framework ry) that stewards the development, ecosystem, governance and promotion of Robot Framework and its community."
	},
	{
		"term": "Robot Framework® Certified Professional",
		"aliasses": ["RFCP"],
		"abbreviation": "RFCP",
		"definition": "The foundational certification level for Robot Framework that validates understanding of core concepts, syntax and basic control structures."
	},
	{
		"term": "Root Suite",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The top-level suite in a Robot Framework execution, determined by the initial directory or file path passed to the robot command."
	},
	{
		"term": "Scalar Access Syntax (${})",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The standard variable access form in Robot Framework used to read values regardless of whether the underlying variable was defined as scalar, list-like or dictionary-like."
	},
	{
		"term": "Scalar Variable",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A Robot Framework variable accessed with the ${} syntax that holds a single value of any supported data type."
	},
	{
		"term": "Skip Status",
		"aliasses": [],
		"abbreviation": "",
		"definition": "An execution status indicating that an element (such as a test or task) was intentionally not executed, for example due to selection options or an explicit skip."
	},
	{
		"term": "Standard Library (Robot Framework)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A library that is shipped with Robot Framework itself, providing generic functionality such as operating system interaction, string manipulation, or process handling."
	},
	{
		"term": "Suite (Test Suite / Task Suite)",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A collection of tests or tasks (and optionally local keywords and variables) defined in a .robot file or directory that is executed as a unit by Robot Framework."
	},
	{
		"term": "Suite File",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A .robot file that contains at least one test case or task and is therefore treated by Robot Framework as an executable suite."
	},
	{
		"term": "Suite Setup",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A keyword executed once before any tests|tasks in a suite are run, typically used to prepare common preconditions."
	},
	{
		"term": "Suite Teardown",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A keyword executed once after all tests|tasks in a suite have run, typically used to clean up shared resources."
	},
	{
		"term": "Suite Variable",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A variable whose scope covers all tests|tasks and keywords within a specific suite but is not visible outside that suite."
	},
	{
		"term": "Synthetic Monitoring",
		"aliasses": ["Active Monitoring"],
		"abbreviation": "",
		"definition": "A proactive monitoring technique that runs automated scripts (often using tools like Robot Framework) at regular intervals against live systems to detect issues before real users are affected."
	},
	{
		"term": "Task",
		"aliasses": ["Test Case"],
		"abbreviation": "",
		"definition": "An executable entity in Robot Framework similar to a test case but conceptually used for non-testing automation such as RPA workflows; defined in a *** Tasks *** section."
	},
	{
		"term": "Test Setup",
		"aliasses": ["Task Setup"],
		"abbreviation": "",
		"definition": "A keyword executed before an individual test or task starts, used to prepare preconditions specific to that test|task."
	},
	{
		"term": "Test Teardown",
		"aliasses": ["Task Teardown"],
		"abbreviation": "",
		"definition": "A keyword executed after an individual test or task finishes, used to clean up resources specific to that test|task."
	},
	{
		"term": "Test Template",
		"aliasses": ["Task Template"],
		"abbreviation": "",
		"definition": "A setting that defines a keyword used as a template for multiple tests|tasks, where each row of data calls the template keyword with different arguments."
	},
	{
		"term": "Test Case",
		"aliasses": ["Task"],
		"abbreviation": "Test",
		"definition": "An executable specification in Robot Framework that verifies some aspect of a system’s behavior and is defined in a *** Test Cases *** section."
	},
	{
		"term": "Test Data",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The collection of suites, tests, tasks, resource files, keywords and variables that define what Robot Framework will execute."
	},
	{
		"term": "Test Level",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A classification of testing focus (such as unit, component, integration, system, system integration, acceptance or end-to-end) describing the scope and granularity of tests."
	},
	{
		"term": "Test Tag",
		"aliasses": ["Task Tag"],
		"abbreviation": "",
		"definition": "A label assigned to tests or tasks (using the Tags setting) to categorize them and enable filtering, selection and reporting."
	},
	{
		"term": "Test Timeout",
		"aliasses": ["Task Timeout"],
		"abbreviation": "",
		"definition": "A maximum allowed execution time for a keyword, test or task after which Robot Framework marks the element as failed due to timeout."
	},
	{
		"term": "User Keyword",
		"aliasses": ["Composite Keyword"],
		"abbreviation": "",
		"definition": "A keyword defined in Robot Framework syntax (typically in suites or resource files) that is composed of calls to other keywords and statements, often used to describe higher-level or business-oriented actions."
	},
	{
		"term": "Variable",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A named reference to a value or collection of values in Robot Framework, used to store data and pass it between keywords, tests and tasks."
	},
	{
		"term": "Variable File",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A separate file (often a Python module or other supported format) that provides variables which can be imported into suites using the Variables setting."
	},
	{
		"term": "Variable Scope",
		"aliasses": [],
		"abbreviation": "",
		"definition": "The visibility and lifetime of a variable (such as global, suite, test|task, or local) during a Robot Framework execution."
	},
	{
		"term": "WHILE Loop",
		"aliasses": [],
		"abbreviation": "",
		"definition": "A control structure in Robot Framework that repeatedly executes a block of keywords as long as a given condition evaluates to true."
	}
]
